<?php

class UserSeeder_ADD_KSK extends Seeder
{
    public function run()
    {
        $organazaiton = $this->getOrganization();
        $i = 1;
        foreach ($organazaiton as $company_cc => $soshiki) {
            foreach ($soshiki as $soshiki_cc => $soshiki_nm) {
                // 実行する処理
                $data = [
                    'company_cc' => $company_cc,
                    'soshiki_cc' => $soshiki_cc,
                    'soshiki_nm' => $soshiki_nm,
                    'shain_bn' => date('ymdHis').sprintf('%03d', $i),          // 001とかの0埋め7桁
                    'name' => '名前' . $i,
                    'shain_keitai_cc' => '01',
                    'password' => sha1(date('ymdHis').sprintf('%03d', $i).date('ymdHis').sprintf('%03d', $i)),
                    'created_at' => date('Y/m/d H:i:s'),
                    'created_user' => 'Seeder',
                    'updated_at' => date('Y/m/d H:i:s'),
                    'updated_user' => 'Seeder'
                ];
                $this->db->insert('user', $data);
                $i++;
            }
        }
    }

    private function getOrganization() {
        return
            array(
                '1201' =>
                    array(
                        '1110000' => '役員',
                        '1110900' => '役員付き',
                        '1120300' => '経営企画Ｃ',
                        '1120305' => '経営企画Ｃ　経営企画部',
                        '1120310' => '経営企画Ｃ　経営企画部　事業管理Ｇ',
                        '1120320' => '経営企画Ｃ　経営企画部　戦略Ｇ',
                        '1120330' => '経営企画Ｃ　経営企画部　関係会社統括Ｇ',
                        '1120500' => '経営企画Ｃ　新ＭＳ立上プロジェクト',
                        '1130000' => '総務・人事部',
                        '1130100' => '総務・人事部　総務Ｇ',
                        '1130110' => '総務・人事部　労務Ｇ',
                        '1130120' => '総務・人事部　人事Ｇ',
                        '1130190' => '経理・情報部',
                        '1130200' => '経理・情報部　経理Ｇ',
                        '1130300' => '経理・情報部　情報Ｇ',
                        '1140000' => '経営企画Ｃ　ＩＭＳ部',
                        '1150000' => '監査部',
                        '1160000' => '開発技術Ｃ',
                        '1160050' => '開発技術Ｃ　開発管理部',
                        '1160051' => '開発技術Ｃ　開発管理部　戦略Ｇ',
                        '1160052' => '開発技術Ｃ　開発管理部　管理Ｇ',
                        '1160110' => '開発技術Ｃ　スープ開発部',
                        '1160111' => '開発技術Ｃ　スープ開発部　スープ開発第１Ｇ',
                        '1160112' => '開発技術Ｃ　スープ開発部　スープ開発第２Ｇ',
                        '1160120' => '開発技術Ｃ　洋風ソース開発部',
                        '1160121' => '開発技術Ｃ　洋風ソース開発部　洋風ソース開発第１Ｇ',
                        '1160122' => '開発技術Ｃ　洋風ソース開発部　洋風ソース開発第２Ｇ',
                        '1160130' => '開発技術Ｃ　レトルト開発部',
                        '1160131' => '開発技術Ｃ　レトルト開発部　レトルト開発第１Ｇ',
                        '1160132' => '開発技術Ｃ　レトルト開発部　レトルト開発第２Ｇ',
                        '1160140' => '開発技術Ｃ　スープ開発部　原料開発Ｇ',
                        '1160200' => '開発技術Ｃ　生産技術部',
                        '1160210' => '開発技術Ｃ　生産技術部　プロセス技術開発Ｇ',
                        '1160220' => '開発技術Ｃ　生産技術部　包装設備技術開発Ｇ',
                        '1160310' => '開発技術Ｃ　グローバル化推進Ｇ',
                        '1160320' => '開発技術Ｃ　戦略技術開発Ｇ',
                        '1160400' => '開発技術Ｃ　鈴木町駐在',
                        '1160800' => '開発技術Ｃ　生産技術部　包材設計Ｇ',
                        '1170000' => '生産Ｃ',
                        '1170110' => '生産Ｃ　生産統括部',
                        '1170120' => '生産Ｃ　生産管理部',
                        '1171000' => '生産Ｃ　川崎事業所',
                        '1171100' => '生産Ｃ　川崎事業所　生産部',
                        '1171110' => '生産Ｃ　川崎事業所　生産部　第１課',
                        '1171120' => '生産Ｃ　川崎事業所　生産部　第２課',
                        '1171130' => '生産Ｃ　川崎事業所　生産部　第３課',
                        '1171140' => '生産Ｃ　川崎事業所　生産部　管理課',
                        '1171200' => '生産Ｃ　川崎事業所　管理部',
                        '1171210' => '生産Ｃ　川崎事業所　管理部　総務課',
                        '1171220' => '生産Ｃ　川崎事業所　管理部　品質保証・技術課',
                        '1171230' => '生産Ｃ　川崎事業所　管理部　工務課',
                        '1171600' => '生産Ｃ　川崎事業所　管理部　企画推進課',
                    ),
                '1432' => array('0000000' => 'クノールサービス株式会社'),
                '1434' => array('0000000' => 'クノールトレーディング株式会社'),
            )
        ;
    }
}