<?php
/**
 * Created by PhpStorm.
 * User: DaikiTakeuchi
 * Date: 2016/08/11
 * Time: 18:00
 */
defined('BASEPATH') OR exit('No direct script access allowed');

$lang['company'] = [
    ['company_cc' => '1201', 'company_nm' => 'クノール食品㈱'],
    ['company_cc' => '1432', 'company_nm' => 'クノールサービス㈱'],
    ['company_cc' => '1434', 'company_nm' => 'クノールトレーディング㈱'],
];

$lang['keitai'] = [
    ['keitai_cc' => '01', 'keitai_nm' => '正社員'],
    ['keitai_cc' => '02', 'keitai_nm' => 'パート'],
    ['keitai_cc' => '03', 'keitai_nm' => '派遣社員'],
    ['keitai_cc' => '04', 'keitai_nm' => '嘱託・契約社員'],
];

$lang['organization'] = array(
    'クノール食品㈱' => array(
        '1201|1110000' => '役員',
        '1201|1110900' => '役員付き',
        '1201|1120300' => '経営企画Ｃ',
        '1201|1120305' => '経営企画Ｃ　経営企画部',
        '1201|1120310' => '経営企画Ｃ　経営企画部　事業管理Ｇ',
        '1201|1120320' => '経営企画Ｃ　経営企画部　戦略Ｇ',
        '1201|1120330' => '経営企画Ｃ　経営企画部　関係会社統括Ｇ',
        '1201|1120500' => '経営企画Ｃ　新ＭＳ立上プロジェクト',
        '1201|1130000' => '総務・人事部',
        '1201|1130100' => '総務・人事部　総務Ｇ',
        '1201|1130110' => '総務・人事部　労務Ｇ',
        '1201|1130120' => '総務・人事部　人事Ｇ',
        '1201|1130190' => '経理・情報部',
        '1201|1130200' => '経理・情報部　経理Ｇ',
        '1201|1130300' => '経理・情報部　情報Ｇ',
        '1201|1140000' => '経営企画Ｃ　ＩＭＳ部',
        '1201|1150000' => '監査部',
        '1201|1160000' => '開発技術Ｃ',
        '1201|1160050' => '開発技術Ｃ　開発管理部',
        '1201|1160051' => '開発技術Ｃ　開発管理部　戦略Ｇ',
        '1201|1160052' => '開発技術Ｃ　開発管理部　管理Ｇ',
        '1201|1160110' => '開発技術Ｃ　スープ開発部',
        '1201|1160111' => '開発技術Ｃ　スープ開発部　スープ開発第１Ｇ',
        '1201|1160112' => '開発技術Ｃ　スープ開発部　スープ開発第２Ｇ',
        '1201|1160120' => '開発技術Ｃ　洋風ソース開発部',
        '1201|1160121' => '開発技術Ｃ　洋風ソース開発部　洋風ソース開発第１Ｇ',
        '1201|1160122' => '開発技術Ｃ　洋風ソース開発部　洋風ソース開発第２Ｇ',
        '1201|1160130' => '開発技術Ｃ　レトルト開発部',
        '1201|1160131' => '開発技術Ｃ　レトルト開発部　レトルト開発第１Ｇ',
        '1201|1160132' => '開発技術Ｃ　レトルト開発部　レトルト開発第２Ｇ',
        '1201|1160140' => '開発技術Ｃ　スープ開発部　原料開発Ｇ',
        '1201|1160200' => '開発技術Ｃ　生産技術部',
        '1201|1160210' => '開発技術Ｃ　生産技術部　プロセス技術開発Ｇ',
        '1201|1160220' => '開発技術Ｃ　生産技術部　包装設備技術開発Ｇ',
        '1201|1160310' => '開発技術Ｃ　グローバル化推進Ｇ',
        '1201|1160320' => '開発技術Ｃ　戦略技術開発Ｇ',
        '1201|1160400' => '開発技術Ｃ　鈴木町駐在',
        '1201|1160800' => '開発技術Ｃ　生産技術部　包材設計Ｇ',
        '1201|1170000' => '生産Ｃ',
        '1201|1170110' => '生産Ｃ　生産統括部',
        '1201|1170120' => '生産Ｃ　生産管理部',
        '1201|1171000' => '生産Ｃ　川崎事業所',
        '1201|1171100' => '生産Ｃ　川崎事業所　生産部',
        '1201|1171110' => '生産Ｃ　川崎事業所　生産部　第１課',
        '1201|1171120' => '生産Ｃ　川崎事業所　生産部　第２課',
        '1201|1171130' => '生産Ｃ　川崎事業所　生産部　第３課',
        '1201|1171140' => '生産Ｃ　川崎事業所　生産部　管理課',
        '1201|1171200' => '生産Ｃ　川崎事業所　管理部',
        '1201|1171210' => '生産Ｃ　川崎事業所　管理部　総務課',
        '1201|1171220' => '生産Ｃ　川崎事業所　管理部　品質保証・技術課',
        '1201|1171230' => '生産Ｃ　川崎事業所　管理部　工務課',
        '1201|1171600' => '生産Ｃ　川崎事業所　管理部　企画推進課',
        '1201|1172000' => '生産Ｃ　中部事業所',
        '1201|1172100' => '生産Ｃ　中部事業所　生産部',
        '1201|1172110' => '生産Ｃ　中部事業所　生産部　第１課',
        '1201|1172120' => '生産Ｃ　中部事業所　生産部　第２課',
        '1201|1172130' => '生産Ｃ　中部事業所　生産部　第３課',
        '1201|1172200' => '生産Ｃ　中部事業所　管理部',
        '1201|1172210' => '生産Ｃ　中部事業所　管理部　総務課',
        '1201|1172230' => '生産Ｃ　中部事業所　管理部　品質保証課',
        '1201|1172240' => '生産Ｃ　中部事業所　管理部　生産技術課',
        '1201|1172600' => '生産Ｃ　中部事業所　管理部　企画推進課',
        '1201|1173000' => '生産Ｃ　東海事業所',
        '1201|1173100' => '生産Ｃ　東海事業所　生産部',
        '1201|1173110' => '生産Ｃ　東海事業所　生産部　第１生産課',
        '1201|1173120' => '生産Ｃ　東海事業所　生産部　第２生産課',
        '1201|1173140' => '生産Ｃ　東海事業所　生産部　生産管理課',
        '1201|1173200' => '生産Ｃ　東海事業所　管理部',
        '1201|1173210' => '生産Ｃ　東海事業所　管理部　総務課',
        '1201|1173220' => '生産Ｃ　東海事業所　管理部　品質保証・技術課',
        '1201|1173225' => '生産Ｃ　東海事業所　管理部　工務課',
        '1201|1173600' => '生産Ｃ　東海事業所　管理部　企画推進課',
    ),
    'クノールサービス㈱' => array('1432|0000000' => 'クノールサービス株式会社'),
    'クノールトレーディング㈱' => array('1434|0000000' => 'クノールトレーディング株式会社'),
);

$lang['gender'] = [
    ['gender_cc' => '1', 'gender_nm' => '男性'],
    ['gender_cc' => '2', 'gender_nm' => '女性'],
    ['gender_cc' => '3', 'gender_nm' => 'その他'],
];